/*

正则表达式

*/
export default {
    /*
        手机号
        请输入正确手机号
     */
    PHONE_REG: /^1[0-9]{10}$/,
    /*
        密码
        请输入6-16位字母或数字的密码
    */
    PASSWORD_REG: /^[0-9a-zA-Z]{6,16}$/,
    /*
        别名验证
        请正确输入别名，最大不超过12个字符
    */
    EBpayNAME_REG: /^[0-9a-zA-Z\u4e00-\u9fa5]{1,12}$/,
    /*
        验证码
        请输入正确验证码
    */
    CODE_REG: /^[a-zA-z0-9]{4,6}$/,
    /*
        银行卡
        请输入正确的银行卡号
    */
    BANK_CODE: /^[1-9]\d{9,19}$/,
    /*
        QQ号码
        请输入正确的QQ号码
    */
    QQ_REG: /^[1-9][0-9]{4,10}$/,
    /*
        特殊字符
    */
    REAL_NAME_SPECIAL: new RegExp( // 特殊字符
        "[`~!@#$^&*()=|{}':;',\\[\\].<>/?~！@#￥……&*（）&mdash;—|{}【】‘；：”“'。，、？]",
    ),


}
